---
kind: method
id: M:Autodesk.Revit.DB.Electrical.WireMaterialTypeSet.ReverseIterator
source: html/99a39e21-6a63-3b41-f0c6-1a3f20a1d047.htm
---
# Autodesk.Revit.DB.Electrical.WireMaterialTypeSet.ReverseIterator Method

Retrieve a backward moving iterator to the set.

## Syntax (C#)
```csharp
public virtual WireMaterialTypeSetIterator ReverseIterator()
```

## Returns
Returns a backward moving iterator to the set.